{
    "projects": [
        {
            "slug": "Hazem-Portfolio",
            "title": "Hazem Khaled's Portfolio ",
            "technologies": [
                "Next JS",
                "Tailwind",
                "Typescript",
                "Formspree"
            ],
            "body": "The portfolio website I crafted elegantly balances simplicity and style, alternating between black and white sections. Its user experience is optimized with a sleek top navigation bar that converts to a drawer-style menu on smaller screens, while the website's performance is enhanced through background loading of the drawer navigation for responsiveness. Three distinct sections present the individual's services, background, and contact information. Leveraging Next.js, TypeScript, Tailwind CSS, and Formspree, the site seamlessly combines modern technologies for a polished result. Its adaptable structure sets the stage for potential future enhancements. In summary, the website embodies minimalistic sophistication, offering a captivating experience that harmonizes design and functionality.",
            "demo_url": "https://hazemkhaled.com",
            "code_url": "https://github.com/HazemKhaled/hazemkhaled.com",
            "image": "/assets/hazemkhaled.com-img.png"
        },
        {
            "slug": "Colib",
            "title": "ColorLib (Not my project) ",
            "technologies": [
                "jQuery",
                "PHP",
                "HSTS"
            ],
            "body": "Colorlib is a renowned web development company known for its high-quality website templates, WordPress themes, and free resources. They have a strong community presence and provide excellent customer support while staying up-to-date with the latest web design trends and technologies.",
            "demo_url": "https://colorlib.com/wp/",
            "code_url": "https://github.com/khaledhn",
            "image": "/assets/Colorlibs.jpeg"
        },
        {
            "slug": "hubspot",
            "title": "HubSpot (Not my project) ",
            "technologies": [
                "React",
                "Core-js",
                "Impact"
            ],
            "body": "HubSpot is a leading inbound marketing and CRM platform that helps businesses attract, engage, and delight customers. It offers a comprehensive suite of tools for marketing, sales, and customer service, along with educational resources through HubSpot Academy. With a wide user base and a focus on inbound methodology, HubSpot remains a prominent force in digital marketing and customer relationship management.",
            "demo_url": "https://www.hubspot.com/",
            "code_url": "https://github.com/khaledhn/xyz",
            "image": "/assets/HubSpot.webp"
        },
        {
            "slug": "knapsack",
            "title": "Knapsack (Not my project) ",
            "technologies": [
                "jQuery",
                "JavaScript",
                "Core-js",
                "Hotjar"
            ],
            "body": "The knapsack problem is a classic optimization problem where the goal is to find the best combination of items to include in a knapsack, subject to its weight capacity. It can be of different types, including 0/1 knapsack (items are either included entirely or not at all), fractional knapsack (items can be divided), and multiple knapsack (multiple knapsacks with varying capacities). The problem can be solved using dynamic programming, greedy algorithms, branch and bound, or metaheuristic techniques like genetic algorithms. Knapsack problems have practical applications in resource allocation, finance, cloud computing, manufacturing, and more.",
            "demo_url": "https://www.knapsack.cloud",
            "code_url": "https://github.com/khaledhn/xyz",
            "image": "/assets/knapsack.webp"
        }
    ]
}