{
    "projects": [
        {
            "slug": "Trav",
            "title": "Travelious",
            "technologies": [
                "React",
                "Tailwind",
                "Typescript"
            ],
            "body": "Travelious is a comprehensive travel platform that uses advanced technology and personalized recommendations to simplify travel planning, offering a seamless booking experience and extensive destination information. It provides tailored suggestions based on user preferences, offers a wide range of travel resources, and fosters a community of travelers. Overall, Travelious aims to enhance the travel experience and empower individuals to embark on memorable journeys.",
            "demo_url": "https://example.com/",
            "code_url": "https://github.com/khaledhn",
            "image": "/projectsAssets/Travelious.jpeg"
        },
        {
            "slug": "Colib",
            "title": "ColorLib",
            "technologies": [
                "jQuery",
                "PHP",
                "HSTS"
            ],
            "body": "Colorlib is a renowned web development company known for its high-quality website templates, WordPress themes, and free resources. They have a strong community presence and provide excellent customer support while staying up-to-date with the latest web design trends and technologies.",
            "demo_url": "https://colorlib.com/wp/",
            "code_url": "https://github.com/khaledhn",
            "image": "/projectsAssets/Colorlibs.jpeg"
        },
        {
            "slug": "hubspot",
            "title": "HubSpot",
            "technologies": [
                "string",
                "string"
            ],
            "body": "HubSpot is a leading inbound marketing and CRM platform that helps businesses attract, engage, and delight customers. It offers a comprehensive suite of tools for marketing, sales, and customer service, along with educational resources through HubSpot Academy. With a wide user base and a focus on inbound methodology, HubSpot remains a prominent force in digital marketing and customer relationship management.",
            "demo_url": "https://example.com/",
            "code_url": "https://github.com/khaledhn/xyz",
            "image": "/projectsAssets/HubSpot.webp"
        },
        {
            "slug": "project-unique-url-key",
            "title": "example title",
            "technologies": [
                "string",
                "string"
            ],
            "body": "Long text",
            "demo_url": "https://example.com/",
            "code_url": "https://github.com/khaledhn/xyz",
            "image": "/public/projectsAssets/white23.png"
        }
    ]
}